import NgwConnector from '../NgwConnector/NgwConnector';

var _connector;

export var getConnector = function (options) {
  _connector = new NgwConnector(options);
  return _connector;
};

// Fake connector for test only

// var DELAY = 100;
// export var getConnector = function () {
//   var connector = function () {

//   }

//   connector.prototype.connect = function (id, callback) {
//     return setTimeout(function () {
//       callback(

//         {
//           'resource': {
//             'id': 178,
//             'cls': 'vector_layer',
//             'parent': {
//               'id': 170,
//               'parent': {
//                 'id': 0
//               }
//             },
//             'owner_user': {
//               'id': 8
//             },
//             'permissions': [],
//             'keyname': null,
//             'display_name': 'ЧС-3',
//             'description': null,
//             'children': true,
//             'interfaces': [
//               'IFeatureLayer',
//               'IWritableFeatureLayer',
//               'IBboxLayer'
//             ],
//             'scopes': [
//               'resource',
//               'datastruct',
//               'data',
//               'metadata'
//             ]
//           },
//           'feature_layer': {
//             'fields': [
//               {
//                 'id': 379,
//                 'keyname': 'name',
//                 'datatype': 'STRING',
//                 'typemod': null,
//                 'display_name': 'name',
//                 'label_field': false,
//                 'grid_visibility': true
//               },
//               {
//                 'id': 380,
//                 'keyname': 'descript',
//                 'datatype': 'STRING',
//                 'typemod': null,
//                 'display_name': 'descript',
//                 'label_field': false,
//                 'grid_visibility': true
//               },
//               {
//                 'id': 381,
//                 'keyname': 'region',
//                 'datatype': 'STRING',
//                 'typemod': null,
//                 'display_name': 'region',
//                 'label_field': false,
//                 'grid_visibility': true
//               },
//               {
//                 'id': 382,
//                 'keyname': 'lon',
//                 'datatype': 'REAL',
//                 'typemod': null,
//                 'display_name': 'lon',
//                 'label_field': false,
//                 'grid_visibility': true
//               },
//               {
//                 'id': 383,
//                 'keyname': 'geo',
//                 'datatype': 'STRING',
//                 'typemod': null,
//                 'display_name': 'geo',
//                 'label_field': false,
//                 'grid_visibility': true
//               },
//               {
//                 'id': 384,
//                 'keyname': 'lat',
//                 'datatype': 'REAL',
//                 'typemod': null,
//                 'display_name': 'lat',
//                 'label_field': false,
//                 'grid_visibility': true
//               },
//               {
//                 'id': 385,
//                 'keyname': 'num',
//                 'datatype': 'STRING',
//                 'typemod': null,
//                 'display_name': 'num',
//                 'label_field': false,
//                 'grid_visibility': true
//               },
//               {
//                 'id': 386,
//                 'keyname': 'date',
//                 'datatype': 'STRING',
//                 'typemod': null,
//                 'display_name': 'date',
//                 'label_field': false,
//                 'grid_visibility': true
//               },
//               {
//                 'id': 387,
//                 'keyname': 'type',
//                 'datatype': 'STRING',
//                 'typemod': null,
//                 'display_name': 'type',
//                 'label_field': false,
//                 'grid_visibility': true
//               },
//               {
//                 'id': 388,
//                 'keyname': 'idrec',
//                 'datatype': 'STRING',
//                 'typemod': null,
//                 'display_name': 'idrec',
//                 'label_field': false,
//                 'grid_visibility': true
//               },
//               {
//                 'id': 389,
//                 'keyname': 'answer',
//                 'datatype': 'STRING',
//                 'typemod': null,
//                 'display_name': 'answer',
//                 'label_field': false,
//                 'grid_visibility': true
//               }
//             ]
//           },
//           'resmeta': {
//             'items': {}
//           },
//           'vector_layer': {
//             'srs': {
//               'id': 3857
//             },
//             'geometry_type': 'POINT'
//           }
//         }

//       );
//     }, DELAY);
//   }

//   connector.prototype.geojson = function (id, callback) {
//     setTimeout(function () {
//       callback({'crs': {'type': 'name', 'properties': {'name': 'EPSG:3857'}}, 'type': 'FeatureCollection', 'features': [{'geometry': {'type': 'Point', 'coordinates': [8122674.99951517, 9637124.93057624]}, 'type': 'Feature', 'properties': {'lat': 65.108938, 'name': 'Газпромнефть', 'lon': 72.967231, 'region': 'ЯНАО', 'descript': '2017.10.13. По требованию прокуратуры "Газпромнефть - Ноябрьскнефтегаз" оштрафована за ущерб от выявленных ранее разливов нефти ', 'geo': 'ЯНАО, Надымский район, Сугмутское месторождение', 'date': '2017-Q4', 'num': '2.1. ', 'answer': 'Мы не согласны с данной постановкой', 'type': 'аварийная ситуация', 'idrec': 'GZ-2017-Q4-001'}, 'id': 1}, {'geometry': {'type': 'Point', 'coordinates': [8698857.00281629, 8919021.7467057]}, 'type': 'Feature', 'properties': {'lat': 62.251485, 'name': 'Газпромнефть', 'lon': 78.143162, 'region': 'ХМАО-Югра', 'descript': '2017.11.03. Прокуратура сообщила о выполнении "Газпромнефть - Ноябрьскнефтегаз" требования о получении разрешения на эксплуатацию трубопроводов ', 'geo': 'ХМАО-Югра,  Нижневартовский район, Вынгапуровское месторождение', 'date': '2017-Q4', 'num': '2.2.', 'answer': '', 'type': 'аварийная ситуация', 'idrec': 'GZ-2017-Q4-002'}, 'id': 2}, {'geometry': {'type': 'Point', 'coordinates': [5955446.03835127, 6935697.7324449]}, 'type': 'Feature', 'properties': {'lat': 52.743528, 'name': 'Газпромнефть', 'lon': 53.498682, 'region': 'Оренбургская область', 'descript': '2017.12.04. Арбитражный суд подтвердил решение Россельхознадзора оштрафовать "Газпромнефть  - Оренбург" за порчу почв вследствие разлива нефти в 2014 г. ', 'geo': 'Оренбургская область', 'date': '2017-Q4', 'num': '2.3. ', 'answer': 'Мы не согласны с данной постановкой', 'type': 'аварийная ситуация', 'idrec': 'GZ-2017-Q4-003'}, 'id': 3}, {'geometry': {'type': 'Point', 'coordinates': [8254510.0045447, 9244395.56770956]}, 'type': 'Feature', 'properties': {'lat': 63.581971, 'name': 'Газпромнефть', 'lon': 74.151525, 'region': 'ЯНАО', 'descript': '2017.12.13. Прокуратура сообщила о выполнении "Газпромнефть - Ноябрьскнефтегаз" требования о получении разрешения на эксплуатацию трубопроводов ', 'geo': 'ЯНАО, Вынгаяхинское месторождение ', 'date': '2017-Q4', 'num': '2.4.', 'answer': 'Мы не согласны с данной постановкой', 'type': 'аварийная ситуация', 'idrec': 'GZ-2017-Q4-004'}, 'id': 4}, {'geometry': {'type': 'Point', 'coordinates': [7428266.13101705, 10011938.0588852]}, 'type': 'Feature', 'properties': {'lat': 66.488846, 'name': 'Газпромнефть', 'lon': 66.72925, 'region': 'ЯНАО', 'descript': '2017.12.26. "Краноленинскнефтегаз" (подрядчик "Газпромнефть - Ноябрьскнефтегаз" выполнила решение суда о выплате ущерба в обращении с буровыми отходами в 2014 г. ', 'geo': 'ЯНАО, Воргенский лицензионный участок', 'date': '2017-Q4', 'num': '2.5.', 'answer': '', 'type': 'аварийная ситуация', 'idrec': 'GZ-2017-Q4-005'}, 'id': 5}, {'geometry': {'type': 'Point', 'coordinates': [7819884.98268205, 8643626.75402592]}, 'type': 'Feature', 'properties': {'lat': 61.077442, 'name': 'Газпромнефть', 'lon': 70.247222, 'region': 'ХМАО-Югра', 'descript': '2017.12.27. "Газпромнефть-Хантос" подала иск в суд против Росприроднадзора с  требованием вернуть переплаченные 530 млн.рублей платежей за негативное воздействие на окружающую среду (сжигание ПНГ)', 'geo': 'ХМАО-Югра,  Южно-Приобское месторождение', 'date': '2017-Q4', 'num': '2.6.', 'answer': 'Мы не согласны с данной постановкой', 'type': 'аварийная ситуация', 'idrec': 'GZ-2017-Q4-006'}, 'id': 6}, {'geometry': {'type': 'Point', 'coordinates': [8944685.9494054, 10410042.7850334]}, 'type': 'Feature', 'properties': {'lat': 67.875308, 'name': 'Лукойл', 'lon': 80.351481, 'region': 'ЯНАО', 'descript': '2017.10.02. Стало известно о пожаре на буровой площадке компании "Евразия" (возможный подрядчик "Лукойл", в результате которого два человека получили ожоги.', 'geo': 'ЯНАО, Тазовский район, Пякяхинское месторождение', 'date': '2017-Q4', 'num': '3.1.', 'answer': 'Мы не согласны с данной постановкой', 'type': 'аварийная ситуация', 'idrec': 'LK-2017-Q4-007'}, 'id': 7}, {'geometry': {'type': 'Point', 'coordinates': [5056430.72126072, 6439099.31202809]}, 'type': 'Feature', 'properties': {'lat': 49.958543, 'name': 'Лукойл', 'lon': 45.42269, 'region': 'Волгоградская область', 'descript': '2017.10.03 Третий по счету суд подтвердил законность требования Россельхознадзора к компании "РИТЭК" (дочка "Лукойл") о выплате штрафа и компенсации ущерба за разлив нефти. ', 'geo': 'Волгоградская область, Николаевский район, с.Солодушино', 'date': '2017-Q4', 'num': '3.2.', 'answer': '', 'type': 'аварийная ситуация', 'idrec': 'LK-2017-Q4-008'}, 'id': 8}, {'geometry': {'type': 'Point', 'coordinates': [4921073.01094504, 7588468.44731294]}, 'type': 'Feature', 'properties': {'lat': 56.15067, 'name': 'Лукойл', 'lon': 44.206751, 'region': 'Нижегородская область', 'descript': '2017.10.05. В результате сильного пожара на Кстовском НПЗ компании "Лукойл" погибли 4 человека', 'geo': 'Нижегородская облость, г.Кстово', 'date': '2017-Q4', 'num': '3.3.', 'answer': 'Мы не согласны с данной постановкой', 'type': 'аварийная ситуация', 'idrec': 'LK-2017-Q4-009'}, 'id': 9}, {'geometry': {'type': 'Point', 'coordinates': [8354580.7721128, 8684502.25206665]}, 'type': 'Feature', 'properties': {'lat': 61.254528, 'name': 'Лукойл', 'lon': 75.050476, 'region': 'ХМАО-Югра', 'descript': '2017.10.11. Природнадзор Югры оштрафовал "Лукойл-Лангепаснефтегаз" за разлив, который обнаружила общественная природоохранная организация', 'geo': 'ХМАО-Югра, автодорога Лангепас-Покачи', 'date': '2017-Q4', 'num': '3.4.', 'answer': 'Мы не согласны с данной постановкой', 'type': 'аварийная ситуация', 'idrec': 'LK-2017-Q4-010'}, 'id': 10}, {'geometry': {'type': 'Point', 'coordinates': [8369080.02446913, 8684310.82707499]}, 'type': 'Feature', 'properties': {'lat': 61.253701, 'name': 'Лукойл', 'lon': 75.180725, 'region': 'ХМАО-Югра', 'descript': '2017.11.19. Из ответа Ростехнадзора следует, что обнаруженный общественниками разлив нефти произошел из бесхозного нефтепровода. "Лукойл-Лангепаснефтегаз" проводит уборку появляющихся из него утечек, но не несет за них ответственности ', 'geo': 'ХМАО-Югра, Урьевское месторождение около г. Лангепас', 'date': '2017-Q4', 'num': '3.5. ', 'answer': 'Мы не согласны с данной постановкой', 'type': 'аварийная ситуация', 'idrec': 'LK-2017-Q4-011'}, 'id': 11}, {'geometry': {'type': 'Point', 'coordinates': [6669433.22229265, 9930373.01464609]}, 'type': 'Feature', 'properties': {'lat': 66.194828, 'name': 'Лукойл', 'lon': 59.912538, 'region': 'Республика Коми', 'descript': '2017-10-27. Шведские, посетившие Коми сделали фотографии, на которых видны мощные факела сжигания попутного газа, предположительно компании "Лукойл-Коми" ', 'geo': 'Республика Коми, Усинский район, Головные сооружения (предположительно)', 'date': '2017-Q4', 'num': '3.6.', 'answer': 'Мы не согласны с данной постановкой', 'type': 'аварийная ситуация', 'idrec': 'LK-2017-Q4-012'}, 'id': 12}, {'geometry': {'type': 'Point', 'coordinates': [6099158.05381201, 9381695.87167407]}, 'type': 'Feature', 'properties': {'lat': 64.125463, 'name': 'Лукойл', 'lon': 54.789669, 'region': 'Республика Коми', 'descript': '2017.11.23. Госсовет Республики Коми в очередной раз отказался рассматривать возможность референдума о запрете эксплуатации старых нефтепроводов, которые на территории Республики в основном принадлежат "Лукойл-Коми". .', 'geo': 'Республика Коми', 'date': '2017-Q4', 'num': '3.7.', 'answer': 'Мы не согласны с данной постановкой', 'type': 'аварийная ситуация', 'idrec': 'LK-2017-Q4-013'}, 'id': 13}, {'geometry': {'type': 'Point', 'coordinates': [6271948.27874082, 7975358.22331113]}, 'type': 'Feature', 'properties': {'lat': 58.038256, 'name': 'Лукойл', 'lon': 56.34187, 'region': 'Пермский край', 'descript': '2017.10.31. Несмотря на протесты местных жителей, подрядчик "Лукойл-Перьм" перекладывает газопровод', 'geo': 'г.Пермь, микрорайон Запруд', 'date': '2017-Q4', 'num': '3.8.', 'answer': 'Мы не согласны с данной постановкой', 'type': 'аварийная ситуация', 'idrec': 'LK-2017-Q4-014'}, 'id': 14}, {'geometry': {'type': 'Point', 'coordinates': [6117106.98586853, 9273892.70124773]}, 'type': 'Feature', 'properties': {'lat': 63.69962, 'name': 'Лукойл', 'lon': 54.950907, 'region': 'Республика Коми', 'descript': '2017.11.07. "Лукойл-Коми"  не убирает недоделки в области ликвидации скважин, оставленные ее подразделениями.', 'geo': 'Республика Коми, Сосногорский район', 'date': '2017-Q4', 'num': '3.9.', 'answer': 'Мы не согласны с данной постановкой', 'type': 'аварийная ситуация', 'idrec': 'LK-2017-Q4-015'}, 'id': 15}, {'geometry': {'type': 'Point', 'coordinates': [6105410.98092936, 9258659.3956301]}, 'type': 'Feature', 'properties': {'lat': 63.638923, 'name': 'Лукойл', 'lon': 54.84584, 'region': 'Республика Коми', 'descript': '2017.11.16. Подрядчик "Лукойл-Коми" допустил утечку нефти из трубопровода. ', 'geo': 'Республика Коми, пос.Нижний Одес.', 'date': '2017-Q4', 'num': '3.10.', 'answer': 'Мы не согласны с данной постановкой', 'type': 'аварийная ситуация', 'idrec': 'LK-2017-Q4-016'}, 'id': 16}, {'geometry': {'type': 'Point', 'coordinates': [8871351.0065801, 8761768.20749902]}, 'type': 'Feature', 'properties': {'lat': 61.586562, 'name': 'Лукойл', 'lon': 79.692702, 'region': 'ХМАО-Югра', 'descript': '2017.11.30. Природнадзор Югры подтвердил выявленное общественниками загрязнение нефтепродуктами в водоохранной зоне р. Урьевский Еган вследствие старого (2014 г.) разлива на территори бывшего лицензионного участка "Лукойл-Лагепаснефтегаз". Кто его должен убирать - непонятно ', 'geo': 'ХМАО-Югра, Нижевартовский район, 119 квартал Лангепасского участкового лесничества. ', 'date': '2017-Q4', 'num': '3.11.', 'answer': 'Мы не согласны с данной постановкой', 'type': 'аварийная ситуация', 'idrec': 'LK-2017-Q4-017'}, 'id': 17}, {'geometry': {'type': 'Point', 'coordinates': [7121736.11325175, 10294379.5030319]}, 'type': 'Feature', 'properties': {'lat': 67.480686, 'name': 'Лукойл', 'lon': 63.975644, 'region': 'Республика Коми', 'descript': 'Серия минингов протеста, в том числе по вопросу референдума о запрете использваония старых нефтпроводов и новых проектов   "Лукойл-Коми". ', 'geo': 'Республика Коми, Сыктывкар, Воркута, населенные пункты Усинского, Ижемского, Сосногорского и Ухтинского районов. ', 'date': '2017-Q4', 'num': '3.12.', 'answer': 'Мы не согласны с данной постановкой', 'type': 'аварийная ситуация', 'idrec': 'LK-2017-Q4-018'}, 'id': 18}, {'geometry': {'type': 'Point', 'coordinates': [8518394.86122099, 9459048.51002743]}, 'type': 'Feature', 'properties': {'lat': 64.427056, 'name': 'Роснефть', 'lon': 76.522043, 'region': 'ЯНАО', 'descript': '2017.10.10. Суд второй инстанции поддержал требование прокуратуры обязать "Роснефть-Пурнефтегаз" получить разрешение на эксплуатацию нефтепроводов', 'geo': 'ЯНАО, Губкинское, Северо-Тарасовское и Харампуркское месторождения', 'date': '2017-Q4', 'num': '7.1.', 'answer': 'Мы не согласны с данной постановкой', 'type': 'аварийная ситуация', 'idrec': 'RN-2017-Q4-019'}, 'id': 19}, {'geometry': {'type': 'Point', 'coordinates': [15934159.145505, 6756646.89394561]}, 'type': 'Feature', 'properties': {'lat': 51.758892, 'name': 'Роснефть', 'lon': 143.13899, 'region': 'Сахалинская область', 'descript': '2017.10.15. Утечка газа их магистрального газопровода "Даги-Ноглики-Катангли" компании "Роснефть-Сахалинморнефтегаз" ', 'geo': 'Сахалинская область, 6-й км газопровода "Даги-Ноглики-Катангли" ', 'date': '2017-Q4', 'num': '7.2.', 'answer': 'Мы не согласны с данной постановкой', 'type': 'аварийная ситуация', 'idrec': 'RN-2017-Q4-020'}, 'id': 20}, {'geometry': {'type': 'Point', 'coordinates': [5963539.96720736, 7105887.26936824]}, 'type': 'Feature', 'properties': {'lat': 53.659264, 'name': 'Роснефть', 'lon': 53.571391, 'region': 'Оренбургская область', 'descript': '2017.10.17. Россельхознадзор сообщил, что в связи с реорганизацией ООО "Бугурусланнефть", ответственной за допущенные этой компанией летом 2017 г. два разлива нефти будет нести ПАО "Оренбургнефть" ', 'geo': 'Оренбургская область, Абулинский городской округ, 2 км СЗ от с.Ново-Якупово.', 'date': '2017-Q4', 'num': '7.3.', 'answer': 'Мы не согласны с данной постановкой', 'type': 'спорная ситуация', 'idrec': 'RN-2017-Q4-021'}, 'id': 21}, {'geometry': {'type': 'Point', 'coordinates': [5765853.02684314, 6886730.25652709]}, 'type': 'Feature', 'properties': {'lat': 52.476416, 'name': 'Роснефть', 'lon': 51.795539, 'region': 'Оренбургская область', 'descript': '2017.11.01.  Россельхознадзор оштрафовал ПАО "Оренбургнефть" (дочерняя "Роснефти") за разлив соленых вод', 'geo': 'Оренбургская область,  Курманаевский район, Ромашкинский сельсовет.', 'date': '2017-Q4', 'num': '7.4.', 'answer': '', 'type': 'спорная ситуация', 'idrec': 'RN-2017-Q4-022'}, 'id': 22}, {'geometry': {'type': 'Point', 'coordinates': [8494082.46179275, 8708854.50584347]}, 'type': 'Feature', 'properties': {'lat': 61.359558, 'name': 'Роснефть', 'lon': 76.303641, 'region': 'ХМАО-Югра', 'descript': '2017.11.3. На Самотлорском месторждении у компании "Самотлорнефтегаз" (дочерняя "Роснефти") произошло газоводопроявление (открытое  фонтанирование) без возгорания. ', 'geo': 'ХМАО-Югра, Самотлорское месторождение', 'date': '2017-Q4', 'num': '7.5.', 'answer': 'Мы не согласны с данной постановкой', 'type': 'спорная ситуация', 'idrec': 'RN-2017-Q4-023'}, 'id': 23}, {'geometry': {'type': 'Point', 'coordinates': [5113427.74770026, 6702737.37450445]}, 'type': 'Feature', 'properties': {'lat': 51.458142, 'name': 'Роснефть', 'lon': 45.934703, 'region': 'Саратовская область', 'descript': '2017.11.20. На Саратовском НПЗ компании "Роснефть" произошло возгорание. ', 'geo': 'г.Саратов, Саратовский НПЗ. ', 'date': '2017-Q4', 'num': '7.7..', 'answer': '', 'type': 'спорная ситуация', 'idrec': 'RN-2017-Q4-024'}, 'id': 24}, {'geometry': {'type': 'Point', 'coordinates': [4424251.89714484, 7279779.07014668]}, 'type': 'Feature', 'properties': {'lat': 54.574811, 'name': 'Роснефть', 'lon': 39.743731, 'region': 'Рязанская область', 'descript': '10.12.2017. На Рязанском НПЗ компании "Роснефть" произошел пожар ', 'geo': 'г.Рязань, Рязанский НПЗ', 'date': '2017-Q4', 'num': '7.8.', 'answer': 'Мы не согласны с данной постановкой', 'type': 'спорная ситуация', 'idrec': 'RN-2017-Q4-025'}, 'id': 25}, {'geometry': {'type': 'Point', 'coordinates': [5617548.97106769, 7034279.68328314]}, 'type': 'Feature', 'properties': {'lat': 53.27635, 'name': 'Роснефть', 'lon': 50.463301, 'region': 'Самарская область', 'descript': '2017.12.16. ПАО "Оренбургнефть" (дочерняя "Роснефти") пытается изменить границы памятника природы "Мулин Дол" с целью поиска и добычи нефти', 'geo': 'Самарская область, Черниговский район, памятник природы "Мулин Дол" ', 'date': '2017-Q4', 'num': '7.9. ', 'answer': 'Мы не согласны с данной постановкой', 'type': 'спорная ситуация', 'idrec': 'RN-2017-Q4-026'}, 'id': 26}, {'geometry': {'type': 'Point', 'coordinates': [4236766.94283387, 5552907.81246429]}, 'type': 'Feature', 'properties': {'lat': 44.562505, 'name': 'Роснефть', 'lon': 38.059525, 'region': 'Краснодарский край', 'descript': '2017.12.20. Несмотря на протесты общественности и неготовность к ликвидации крупных разливов нефти "Роснефть" и итальнянские компании ENI и Saipem начали разведочное бурение на шельфе Черного моря. ', 'geo': 'Черное море, Западно-Черноморский лицензионный участок. ', 'date': '2017-Q4', 'num': '7.10.', 'answer': '', 'type': 'спорная ситуация', 'idrec': 'RN-2017-Q4-027'}, 'id': 27}, {'geometry': {'type': 'Point', 'coordinates': [7951490.0016436, 8160797.2651955]}, 'type': 'Feature', 'properties': {'lat': 58.909246, 'name': 'Роснефть', 'lon': 71.42945, 'region': 'ХМАО-Югра', 'descript': '2017.12.21. Прокуратура сообщила, что после возбужденных ей административных дел "Роснефть-Уватнефтегаз" устранила нарушения  в области обращения с отходами, правли пожарной и санитарной безопасности в лесах, требований промышленной безопасности', 'geo': 'ХМАО-Югра, Уватский район.  ', 'date': '2017-Q4', 'num': '7.11.', 'answer': 'Мы не согласны с данной постановкой', 'type': 'спорная ситуация', 'idrec': 'RN-2017-Q4-028'}, 'id': 28}, {'geometry': {'type': 'Point', 'coordinates': [5893010.05291107, 7074036.71080592]}, 'type': 'Feature', 'properties': {'lat': 53.489373, 'name': 'Роснефть', 'lon': 52.93781, 'region': 'Оренбургская область', 'descript': '2017.12.25. Суд подтвердил обоснованность наложенного Россельхознадзором штрафа на "Оребургнефть" (дочерняя "Роснефти"), за загрязнение почв в результате разливов нефти. ', 'geo': 'Оренбургская область, Асеекеевский район, Чкаловский сельсовет. ', 'date': '2017-Q4', 'num': '7.12. ', 'answer': '', 'type': 'спорная ситуация', 'idrec': 'RN-2017-Q4-029'}, 'id': 29}]})
//     }, DELAY);
//   }

//   _connector = new connector();
//   return _connector;
// };
